Отчёт по лабораторной работе №12 по курсу "Фундаментальная информатика"
Студент группы: М80-108Б-22 Анциборко Леонид Витальевич, № по списку 1

Контакты e-mail: anciborko04@mail.ru

Работа выполнена: «22» декабря 2022 г.

Преподаватель: асп. каф. 806 Сахарин Никита Александрович

Входной контроль знаний с оценкой: 3 (удовлетворительно)

Отчет сдан «22» декабря 2022 г., итоговая оценка 3 (удовлетворительно)

Подпись преподавателя: ________________

1. Тема
Техника работы с целыми числами. Системы счисления.

2. Цель работы
Составить программу на языке Си в целом типе данных, которая для любых допустимых и корректно записанных чисел этого типа в десятичном изображении, поступающих на стандартный ввод программы, выполняет указанное вариантом действие над их значениями.

3. Задание (вариант № 1)
Убрать среднюю цифру числа.


5. Программное обеспечение:
Операционная система семейства: Windows

Интерпретатор команд: Visual Studio Code

Система программирования: -

Утилиты операционной системы: -

Прикладные системы и программы: gcc

6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
Ввод числа;
Проверка;
Определение его длины;
Запись цифр в массив;
удаление среднего элемента массива;

7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию].

``` c
#include <stdio.h>
#include <conio.h>
#include <string.h>

void number_print(char number[12]){
    int size = strlen(number);
    
    if (number[0] == 45) {
        size -= 1;
        if (size % 2 == 1)
    {
        size = (size / 2) + 1;
        memmove(&number[size], &number[size + 1], strlen(number) - size);
    }
    
    printf("%s\n", number);

    }
    
    else {
    if (size % 2 == 1)
    
    {
    size = size / 2;
    memmove(&number[size], &number[size + 1], strlen(number) - size);
    }
    
    printf("%s\n", number);
    };
}

void main() {
    char symbol, number[12] = "";
    symbol = getchar();
    strcat(number, &symbol);

    while (symbol != EOF)
    {
        if ((symbol == '\n' || symbol == '\t' || symbol == ' ' || symbol == ',') && number[0] != 0 && number[0] != '\n' && number[0] != '\t' && number[0] != ' ' && number[0] != ',')
        {
            number_print(number);
            memset(number, 0, 12);
        }

        else
        {
            if ((number[0] == '\n' || number[0] == '\t' || number[0] == ' ' || number[0] == ',' || number[0] == 0) && number[0] != '-')
            {
                memset(number, 0, 12);
            }

            symbol = getchar();
            if((symbol != '\n' && symbol != '\t' && symbol != ' ' && symbol != ',')){
                strncat(number, &symbol, 1);
            }
        }
    }
    
    getch();
}
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы. Допущен к выполнению работы.
Подпись преподавателя: ________________

8. Распечатка протокола
```
PS D:\c_labs> cd lab12
PS D:\c_labs\lab12> Get-Content f.txt | .\lab12.exe
-13
12
11
1245
13
1111
1212
11
12346789

f.txt:
123, -123, 12, 11
12345
123
1111        1212
11
123456789
```
9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.
№	Лаб. или дом.	Дата	Время	Событие	Действие по исправлению	Примечание
1	дом.	29.10.22	13:00	Выполнение лабораторной работы	-	-
10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.

11. Выводы
Была написана программа на языке на Си, выполняющая указанное вариантом действие над значениями в целом типе данных. В результате выполнения работы, были приобретены навыки для работы с числами в целом типе данных.

Недочёты при выполнении задания могут быть устранены следующим образом: —

Подпись студента: ____________________
