Отчёт по лабораторной работе №13 по курсу "Фундаментальная информатика"
Студент группы: М80-108Б-22 Анциборко Леонид Витальевич, № по списку 1

Контакты e-mail: anciborko04@mail.ru

Работа выполнена: 03.12.2022

Преподаватель: асп. каф. 806 Сахарин Никита Александрович

Входной контроль знаний с оценкой: 4 (хорошо)

Отчет сдан 03.12.2022, итоговая оценка 4 (хорошо)

Подпись преподавателя: ________________

1. Тема
Множества.

2. Цель работы
В соответствии с вариантом задания составить программу проверки характеристик введённых последовательностей слов и печати развёрнутого ответа.

3. Задание (вариант № 2)
Есть ли слово, все гласные которого различны?

5. Программное обеспечение:
Операционная система семейства: Windows

Интерпретатор команд:  Visual Studio Code

Система программирования: -

Утилиты операционной системы: -

Прикладные системы и программы: gcc


6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
Считываем входные данные;
Считываем слово до знаков препинания, передаем его как массив в функцию. Проходим по каждой букве слова, проверяем букву на вхождение в список гласных и в список гласных текущего слова.
Если гласная повторяется, слово не подходит. Если гласные отсутствуют, слово не подходит.
7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию].
``` c
#include <stdio.h>
#include <stdbool.h>
#include <ctype.h>
#include <conio.h>
#include <string.h>

#define VOWELS (1u<<('a'-'a') | 1u<<('e'-'a') | 1u<<('i'-'a') | 1u<<('o'-'a') | 1u<<('u'-'a'))

typedef unsigned int uint;

uint char_to_set(char c)
{
    c = tolower(c);
    if(c < 'a' || c > 'z')
    {
        return 0;
    }else{
        if (c == 'a' || c == 'e' || c == 'i' || c == 'o' || c == 'u'){
            return 1u<<(c-'a');
        } else{
            return 0;
        }
    }
}

bool logic(char * word){
    
    bool flag = false;
    uint set_word_vowels = 0, letter;
    int a = 0;
    
    while(word[a] != 49){
        
        // printf("%d", word[a]);
        letter = char_to_set(word[a]);
        
        if ((VOWELS & ~letter) != VOWELS && (set_word_vowels & ~letter) != set_word_vowels){
            flag = false;
            break;
        }
        
        set_word_vowels = set_word_vowels | letter;
        if (set_word_vowels != 0) {
            flag = true;
            }
        a++;
    }
    return flag;
}

void main()
{   
    bool flag = false;
    char symbol, word[30] = "";
    symbol = getchar();
    strncat(word, &symbol, 1);
    
    while (symbol != EOF) {
        
        if((symbol == 32 || symbol == 10 || symbol == 44 || symbol == 9) && word[0] != 0 && word[0] != 32 && word[0] != 10 && word[0] != 44 && word[0] != 9 )
        {
            strcat(word, "1");
            flag = logic(word);
            if (flag == true){
                break;
            }
            memset(word, 0, 30);
            symbol = getchar();
        }
        
        else {
            if (word[0] == 0 || word[0] == 32 || word[0] == 10 || word[0] == 44 || word[0] == 9)
            {
                memset(word, 0, 30);
            }
            
            symbol = getchar();
            strncat(word, &symbol, 1);
        }
    }
    if (flag == true) {
        printf("word was found\n");
        printf("%s", word);
    }

    if (flag == false) {
        printf("word wasn't found\n");
    }
    
    getch();
}
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы. Допущен к выполнению работы.
Подпись преподавателя: ________________

8. Распечатка протокола

```
PS D:\c_labs\lab12> cd ..
PS D:\c_labs> cd lab13
PS D:\c_labs\lab13> Get-Content f.txt | .\lab13.exe
word was found
oauiy
1 

f.txt:
woord, maan, meme
aaaam, bbbb, ccc, 
ooooo



woord

b

oauiy
```

9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.
№	Лаб. или дом.	Дата	Время	Событие	Действие по исправлению	Примечание
1	дом.	26.11.22	13:00	Выполнение лабораторной работы	-	-
10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.

11. Выводы
Была написана программа на языке на Си, выполняющая указанное вариантом действие над значениями в целом типе данных. В результате выполнения работы, были приобретены навыки для работы с числами в целом типе данных.

Недочёты при выполнении задания могут быть устранены следующим образом: —

Подпись студента: ____________________
